Revit 2026 API

# SchedulableField Operators

---

The SchedulableField type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equality(SchedulableField, SchedulableField) | Determines whether two SchedulableField are the same. |
|  | Inequality(SchedulableField, SchedulableField) | Determines whether two SchedulableField are different. |

#### Reference

SchedulableField Class

Autodesk.Revit.DB Namespace